Revit 2027 API
ModelPathUtils.ConvertUserVisiblePathToModelPath Method
 Converts a user-visible path (string) to a ModelPath.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ModelPath ConvertUserVisiblePathToModelPath(
	string strPath
)
Public Shared Function ConvertUserVisiblePathToModelPath (
	strPath As String
) As ModelPath
public:
static ModelPath^ ConvertUserVisiblePathToModelPath(
	String^ strPath
)
static member ConvertUserVisiblePathToModelPath :
        strPath : string -> ModelPath
Parameters
strPath String
 The path in string form, like RSN://{HostNodeName}/school/project.rvt
Return Value
ModelPath
 A ModelPath representing either a server or file path.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The path may be a server or file path.
See Also
Reference
ModelPathUtils Class
Autodesk.Revit.DB Namespace